/*==============================================================*/
/* Table: Задача                                                */
/*==============================================================*/
create table Задача (
   ИД_задачи            numeric              identity,
   ИД_компании          numeric              not null,
   НаправлениеЗадачи    varchar(250)         not null,
   СтатусЗадачи         bit                  not null,
   ЦенаЗадачи           float                not null,
   ОписаниеЗадачи       varchar(5000)        not null,
   НазваниеЗадачи       varchar(100)         not null,
   constraint PK_ЗАДАЧА primary key (ИД_задачи)
)
go

/*==============================================================*/
/* Index: КомпанияЗадача_FK                                     */
/*==============================================================*/




create nonclustered index КомпанияЗадача_FK on Задача (ИД_компании ASC)
go

/*==============================================================*/
/* Table: Компания                                              */
/*==============================================================*/
create table Компания (
   ИД_компании          numeric              identity,
   НазваниеКомпании     varchar(100)         not null,
   СфераДеятельности    varchar(100)         not null,
   ТелефонКомпании      varchar(20)          not null,
   EmailКомпании        varchar(70)          not null,
   ОписаниеКомпании     varchar(1000)        null,
   ЛогинКомпании        varchar(100)         not null,
   ПарольКомпании       varchar(100)         not null,
   constraint PK_КОМПАНИЯ primary key (ИД_компании)
)
go

/*==============================================================*/
/* Table: ОтзывыКомпании                                        */
/*==============================================================*/
create table ОтзывыКомпании (
   ИД_ОтзываКомпании    numeric              identity,
   ИД_компании          numeric              null,
   ИД_Студента          numeric              not null,
   ОтзывКомпании        varchar(5000)        not null,
   constraint PK_ОТЗЫВЫКОМПАНИИ primary key (ИД_ОтзываКомпании)
)
go

/*==============================================================*/
/* Index: СтудентОтзывыКомпании_FK                              */
/*==============================================================*/




create nonclustered index СтудентОтзывыКомпании_FK on ОтзывыКомпании (ИД_Студента ASC)
go

/*==============================================================*/
/* Index: КомпанияОтзывыКомпании_FK                             */
/*==============================================================*/




create nonclustered index КомпанияОтзывыКомпании_FK on ОтзывыКомпании (ИД_компании ASC)
go

/*==============================================================*/
/* Table: ОтзывыСтудента                                        */
/*==============================================================*/
create table ОтзывыСтудента (
   ИД_ОтзываСтудента    numeric              identity,
   ИД_Студента          numeric              not null,
   ИД_компании          numeric              not null,
   ОтзывСтудента        varchar(5000)        not null,
   constraint PK_ОТЗЫВЫСТУДЕНТА primary key (ИД_ОтзываСтудента)
)
go

/*==============================================================*/
/* Index: СтудентОтзывыСтудента_FK                              */
/*==============================================================*/




create nonclustered index СтудентОтзывыСтудента_FK on ОтзывыСтудента (ИД_Студента ASC)
go

/*==============================================================*/
/* Index: КомпанияОтзывыСтудента_FK                             */
/*==============================================================*/




create nonclustered index КомпанияОтзывыСтудента_FK on ОтзывыСтудента (ИД_компании ASC)
go

/*==============================================================*/
/* Table: Проблема                                              */
/*==============================================================*/
create table Проблема (
   ИД_Проблемы          numeric              identity,
   ИД_компании          numeric              null,
   НаправлениеПроблемы  varchar(250)         not null,
   ЦенаПроблемы         float                not null,
   СтатусПроблемы       bit                  not null,
   ОписаниеПроблемы     varchar(5000)        not null,
   НазваниеПроблемы     varchar(100)         not null,
   constraint PK_ПРОБЛЕМА primary key (ИД_Проблемы)
)
go

/*==============================================================*/
/* Index: КомпанияПробема_FK                                    */
/*==============================================================*/




create nonclustered index КомпанияПробема_FK on Проблема (ИД_компании ASC)
go

/*==============================================================*/
/* Table: РешениеЗадачи                                         */
/*==============================================================*/
create table РешениеЗадачи (
   ИД_РешенияЗадачи     numeric              identity,
   ИД_задачи            numeric              not null,
   ИД_Студента          numeric              null,
   ДатаРешенияЗадачи    datetime             not null,
   СтатусРешенияЗадачи  bit                  not null,
   КомментарийКРешениюЗадачи varchar(5000)        not null,
   СсылкаНаРешениеЗадачи varchar(300)         not null,
   constraint PK_РЕШЕНИЕЗАДАЧИ primary key (ИД_РешенияЗадачи)
)
go

/*==============================================================*/
/* Index: СтудентРешениеЗадачи_FK                               */
/*==============================================================*/




create nonclustered index СтудентРешениеЗадачи_FK on РешениеЗадачи (ИД_Студента ASC)
go

/*==============================================================*/
/* Index: ЗадачиРешениеЗадачи_FK                                */
/*==============================================================*/




create nonclustered index ЗадачиРешениеЗадачи_FK on РешениеЗадачи (ИД_задачи ASC)
go

/*==============================================================*/
/* Table: РешениеПроблемы                                       */
/*==============================================================*/
create table РешениеПроблемы (
   ИД_решенияПроблемы   numeric              identity,
   ИД_Проблемы          numeric              not null,
   ИД_Студента          numeric              not null,
   ДатаРешенияПроблемы  datetime             not null,
   СтатусРешенияПроблемы bit                  not null,
   КомментарийКРешениюПроблемы varchar(1000)        not null,
   СсылкаНаРешениеПроблемы varchar(500)         not null,
   constraint PK_РЕШЕНИЕПРОБЛЕМЫ primary key (ИД_решенияПроблемы)
)
go

/*==============================================================*/
/* Index: СтудентРешениеПроблемы_FK                             */
/*==============================================================*/




create nonclustered index СтудентРешениеПроблемы_FK on РешениеПроблемы (ИД_Студента ASC)
go

/*==============================================================*/
/* Index: ПроблемаРешениеПроблемы_FK                            */
/*==============================================================*/




create nonclustered index ПроблемаРешениеПроблемы_FK on РешениеПроблемы (ИД_Проблемы ASC)
go

/*==============================================================*/
/* Table: Студент                                               */
/*==============================================================*/
create table Студент (
   ИД_Студента          numeric              identity,
   ФИОСтудента          varchar(100)         not null,
   Курс                 int                  not null,
   Факультет            varchar(100)         not null,
   Направление          varchar(250)         not null,
   EmailСтудента        varchar(100)         not null,
   ТелефонСтудента      varchar(20)          not null,
   НомерКартыСтудента   varchar(30)          not null,
   ЛогинСтудента        varchar(50)          not null,
   ПарольСтудента       varchar(50)          not null,
   ОбоМне               varchar(1000)        null,
   constraint PK_СТУДЕНТ primary key (ИД_Студента)
)
go

alter table Задача
   add constraint FK_ЗАДАЧА_КОМПАНИЯЗ_КОМПАНИЯ foreign key (ИД_компании)
      references Компания (ИД_компании)
go

alter table ОтзывыКомпании
   add constraint FK_ОТЗЫВЫКО_КОМПАНИЯО_КОМПАНИЯ foreign key (ИД_компании)
      references Компания (ИД_компании)
go

alter table ОтзывыКомпании
   add constraint FK_ОТЗЫВЫКО_СТУДЕНТОТ_СТУДЕНТ foreign key (ИД_Студента)
      references Студент (ИД_Студента)
go

alter table ОтзывыСтудента
   add constraint FK_ОТЗЫВЫСТ_КОМПАНИЯО_КОМПАНИЯ foreign key (ИД_компании)
      references Компания (ИД_компании)
go

alter table ОтзывыСтудента
   add constraint FK_ОТЗЫВЫСТ_СТУДЕНТОТ_СТУДЕНТ foreign key (ИД_Студента)
      references Студент (ИД_Студента)
go

alter table Проблема
   add constraint FK_ПРОБЛЕМА_КОМПАНИЯП_КОМПАНИЯ foreign key (ИД_компании)
      references Компания (ИД_компании)
go

alter table РешениеЗадачи
   add constraint FK_РЕШЕНИЕЗ_ЗАДАЧИРЕШ_ЗАДАЧА foreign key (ИД_задачи)
      references Задача (ИД_задачи)
go

alter table РешениеЗадачи
   add constraint FK_РЕШЕНИЕЗ_СТУДЕНТРЕ_СТУДЕНТ foreign key (ИД_Студента)
      references Студент (ИД_Студента)
go

alter table РешениеПроблемы
   add constraint FK_РЕШЕНИЕП_ПРОБЛЕМАР_ПРОБЛЕМА foreign key (ИД_Проблемы)
      references Проблема (ИД_Проблемы)
go

alter table РешениеПроблемы
   add constraint FK_РЕШЕНИЕП_СТУДЕНТРЕ_СТУДЕНТ foreign key (ИД_Студента)
      references Студент (ИД_Студента)
go
